In [54]:
import pandas as pd

In [55]:
data = [1, 2, 3, 4, 5]

In [56]:
s = pd.Series(data)

In [57]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [58]:
index = ['Linha' + str(i) for i in range(5)]

In [59]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [60]:
s =pd.Series(data = data, index = index)

In [61]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [62]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [63]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [64]:
s = pd.Series(data)

In [65]:
s1 = s + 2

In [66]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [67]:
s2 =  s + s1

In [68]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## Dataframe

In [69]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [70]:
df1 = pd.DataFrame(data = data)

In [71]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [72]:
index = ['Linha' + str(i) for i in range(3)]

In [73]:
index

['Linha0', 'Linha1', 'Linha2']

In [74]:
df1 = pd.DataFrame(data = data, index = index)

In [75]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [76]:
columns = ['Coluna' + str(i) for i in range(3)]

In [77]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)

In [78]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [79]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [80]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [81]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [82]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [83]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [84]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [85]:
df1[df1 > 0] = 'A'
df1

        0  1  2
Linha0  A  A  A
Linha1  A  A  A
Linha2  A  A  A

In [86]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [87]:
df4 = pd.concat([df1, df2, df3])
df4

          0    1    2 Coluna0 Coluna1 Coluna2
Linha0    A    A    A     NaN     NaN     NaN
Linha1    A    A    A     NaN     NaN     NaN
Linha2    A    A    A     NaN     NaN     NaN
Linha0  NaN  NaN  NaN       B       B       B
Linha1  NaN  NaN  NaN       B       B       B
Linha2  NaN  NaN  NaN       B       B       B
Linha0  NaN  NaN  NaN       1       2       3
Linha1  NaN  NaN  NaN       4       5       6
Linha2  NaN  NaN  NaN       7       8       9

In [88]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

        0  1  2  Coluna0  Coluna1  Coluna2  Coluna0  Coluna1  Coluna2
Linha0  A  A  A        B        B        B        1        2        3
Linha1  A  A  A        B        B        B        4        5        6
Linha2  A  A  A        B        B        B        7        8        9

In [89]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [90]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [91]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [92]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4